 IDENTIFICATION DIVISION.
 PROGRAM-ID. COMPUTEDD.
 AUTHOR. LUCIO
 DATE-WRITTEN. 13/10/2022
******************************
* PICCOLO CALCOLATORE COBOL  *
******************************
 ENVIRONMENT DIVISION.
 SOURCE-COMPUTER. IBM-PC.
 OBJECT-COMPUTER. IBM-PC.
 INPUT-OUTPUT SECTION.
 FILE-CONTROL.

 DATA DIVISION.
 FILE SECTION.
 WORKING-STORAGE SECTION.
 01    VAR1               PIC 9(10).
 01    VAR2               PIC 9(10).
 01    OPERATORE          PIC X.
 01    RESULT             PIC 9(15)V99.        
*
 PROCEDURE DIVISION. 
 MAIN SECTION.
* FAI DA ESEGUI (LABEL) FINO A FINE-ESEGUI FINCHE' L'OPERATORE NON
* E' F
           PERFORM ESEGUI THRU FINE-ESEGUI UNTIL OPERATORE = 'F'.
* FERMO IL PROGRAMMA
     STOP RUN.
 ESEGUI.    
* SELEZIONO OPERATORE CON INPUT UTENTE
     DISPLAY 'Seleziona operatore'.
     ACCEPT OPERATORE.
     EVALUATE OPERATORE
* QUANDO L'UTENTE SCRIVE + 
     WHEN '+' 
* CHIEDO I NUMERI ALL UTENTE E FACCIO SOMMA
     DISPLAY 'INSERISCI PRIMO NUMERO'
     ACCEPT VAR1
     DISPLAY 'INSERISCI SECONDO NUMERO'
     ACCEPT VAR2
     COMPUTE RESULT = VAR1 + VAR2           
* MOSTRO RISULTATO
     DISPLAY 'Risultato: ' RESULT
* SE L'UTENTE SCEGLIE * FACCIO MOLITPLICAZIONE
     WHEN '*'
     DISPLAY 'INSERISCI PRIMO NUMERO'
     ACCEPT VAR1
     DISPLAY 'INSERISCI SECONDO NUMERO'
     ACCEPT VAR2
     COMPUTE RESULT = VAR1 * VAR2
     DISPLAY 'Risultato: ' RESULT
* SE SCEGLIE MENO FACCIO SOTTRAZIONE
     WHEN '-'
     DISPLAY 'INSERISCI PRIMO NUMERO'
     ACCEPT VAR1
     DISPLAY 'INSERISCI SECONDO NUMERO'
     ACCEPT VAR2
     COMPUTE RESULT = VAR1 - VAR2
     DISPLAY 'Risultato: ' RESULT 
* SE SCEGLIE DIVISO
     WHEN '/'
     DISPLAY 'INSERISCI PRIMO NUMERO'
     ACCEPT VAR1
     DISPLAY 'INSERISCI SECONDO NUMERO'
     ACCEPT VAR2
     COMPUTE RESULT = VAR1 / VAR2
     DISPLAY 'Risultato: 'RESULT                                  
******************************************************************
* ALTRIMENTI QUALSIASI ALTRA COSA CHE NON SIA VALIDA INSERITA COME
* OPERATORE RITORNO UN MESSAGGIO DI ERRORE
******************************************************************
     WHEN OTHER 
     DISPLAY 'Operatore non valido, immettere * o / o + o -'
     END-EVALUATE.
 FINE-ESEGUI.
