 IDENTIFICATION DIVISION.
 PROGRAM-ID. MESI.
 AUTHOR. LUCIO
 DATE-WRITTEN. 13/10/2022
* QUESTO E' UN COMMENTO
*
 ENVIRONMENT DIVISION.
 SOURCE-COMPUTER. IBM-PC.
 OBJECT-COMPUTER. IBM-PC.
 INPUT-OUTPUT SECTION.
 FILE-CONTROL.
*
 DATA DIVISION.
 FILE SECTION.
 WORKING-STORAGE SECTION.
 01 TAB-DIP           PIC X(20) VALUE  
 
     
          '13600241003250041400'.
 01 TAB-DIPENDENTI REDEFINES TAB-DIP.
     05 DIPENDENTE             OCCURS 4 TIMES.
          06 MATRICOLA         PIC X.
          06 STIPENDIO          PIC 9(4).
 01 USERSTOP       PIC X.
 01 INDICE         PIC 99.
*
 PROCEDURE DIVISION. 
 MAIN SECTION.
           PERFORM ESEGUI THRU FINE-ESEGUI UNTIL USERSTOP = 'F'.
     STOP RUN. 
     
 ESEGUI.
     DISPLAY 'DIMMI UN CODICE MATRICOLA'    
     ACCEPT INDICE
     DISPLAY 'LA MATRICOLA  CORRISPONDE A'
     DISPLAY STIPENDIO(INDICE) 
     DISPLAY 'SE VUOI FERMARE PREMI F ALTRIMENTI INVIO'
     ACCEPT USERSTOP.

 
 FINE-ESEGUI.