 IDENTIFICATION DIVISION.
 PROGRAM-ID. PRIMO.
 AUTHOR. LUCIO
 DATE-WRITTEN. 13/10/2022
* QUESTO E' UN COMMENTO
*
 ENVIRONMENT DIVISION.
 SOURCE-COMPUTER. IBM-PC.
 OBJECT-COMPUTER. IBM-PC.
 INPUT-OUTPUT SECTION.
 FILE-CONTROL.
*
 DATA DIVISION.
 FILE SECTION.
 WORKING-STORAGE SECTION.
                      
 01    VAR1               PIC XX  VALUE SPACE.
 01    DATA-OGGI.
       05  GIORNO         PIC 99  VALUE ZERO.
       05  MESE           PIC 99.
       05  ANNO.
           10  SECOLO     PIC 99.
           10  AA         PIC 99.
 01    NOME-CLIENTE       PIC X(10) VALUE SPACE.
*
 PROCEDURE DIVISION. 
 MAIN SECTION.            
 
           PERFORM ESEGUI THRU FINE-ESEGUI UNTIL NOME-CLIENTE =   
                          'FINITOOOOO'.
* COMMENTO
     STOP RUN.
 ESEGUI.
           DISPLAY 'SCRIVI IL TUO NOME'.
           ACCEPT NOME-CLIENTE.
*           DISPLAY NOME-CLIENTE.
           DISPLAY 'HELLO ' NOME-CLIENTE.
 FINE-ESEGUI.
       EXIT.