 IDENTIFICATION DIVISION.
 PROGRAM-ID. SHELL1.
 AUTHOR. LUCIO
 DATE-WRITTEN. 13/10/2022
* QUESTO E' UN COMMENTO
*
 ENVIRONMENT DIVISION.
 SOURCE-COMPUTER. IBM-PC.
 OBJECT-COMPUTER. IBM-PC.
 INPUT-OUTPUT SECTION.
 FILE-CONTROL.
*
 DATA DIVISION.
 FILE SECTION.
 WORKING-STORAGE SECTION.
*
 PROCEDURE DIVISION. 
 MAIN SECTION.
           DISPLAY 'HELLO'.
     STOP RUN.
